#-*- coding: UTF-8 -*-
__author__ = 'yuyang'

# 接口结果信息码对接池
ResultDic = {

    0     : "",

    # usersystem
    10001 : "用户名或密码不能为空",
    10002 : "密码或者用户名出错",
    10003 : "用户名不能超过16个字",
    10004 : "请求失败",
    10005 : "修改失败",
    10006 : "昵称不能超过20个字",
    10007 : "注销失败",
    10008 : "请先进行登录操作",
    10009 : "用户名已经被占领啦",
    10010 : "邮箱已被注册，请更换邮箱注册",
    10011 : "图片格式不正确",
    10012 : "邮箱或密码不能为空",
    10013 : "网络出错",
    10014 : "请求错误",
    10015 : "注册失败",
    10016 : "用户不存在， 注册加入我们吧~~~",
    10017 : "邮箱格式不正确",
    10018 : "密码不能全部为数字",
    10019 : "密码不能全部为字母",
    10020 : "密码不能超过20个字",
    10021 : "密码不能少于6个字",
    10022 : "用户名不能包含以下字符",

    # list

    20001 : "该用户的列表不存在...",
    20002 : "该用户的列表读取失败...",
    20003 : "列表不存在...",
    20004 : "列表获取失败",
    20005 : "列表创建失败",

    # record

    30001 : "",
}
